{
  "__type__": "cc.TextAsset",
  "_name": "argeementTXT",
  "text": "                                   飞腾公司许可及服务协议\n《飞腾公司许可及服务协议》  （以下简称“本协议”）由您与土豪金麻将服务提供方共同缔结，本协议具有合同效力。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议。限制、免责条款可能以黑体加粗形式提示您注意。除非您已阅读并接受本协议所有条款，否则您无权使用上海敲麻麻将服务。您使用飞腾公司服务即视为您已阅读并同意签署本协议。如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。\n 一、【定义】\n1.1 本协议：指本协议正文、《飞腾公司服务协议》、《QQ号码规则》、游戏规则及其修订版本。上述内容一经正式发布，即为本协议不可分割的组成部分。本协议同时还包括文化部根据《网络游戏管理暂行办法》（文化部令第49号）制定的《网络游戏服务格式化协议必备条款》。\n1.2 游戏规则：指飞腾公司服务提供方不时发布并修订的关于土豪金麻将的用户守则、玩家条例、游戏公告及通知等内容。\n1.3 飞腾公司服务提供方：指向您提供飞腾公司及其服务的北京市网圣飞腾有限公司，在本协议中简称为“飞腾公司”。\n1.4 飞腾公司服务：指飞腾公司向您提供的与游戏相关的各项在线运营服务。\n1.5 您：又称“玩家”或“用户”，指被授权使用飞腾公司及其服务的自然人。\n1.6 游戏数据：指您在使用飞腾公司过程中产生的被服务器记录的各种数据，包括游戏日志、安全日志等数据。\n二、【协议的变更和生效】\n2.1 飞腾公司有权在必要时变更本协议条款，并在相关页面进行通知。您可以在飞腾公司的相关页面查阅最新版本的协议条款。\n2.2 本协议条款变更后，如果您继续使用飞腾公司服务，即视为您已接受变更后的协议。如果您不接受变更后的协议，应当停止使用土豪金麻将服务。\n三、【用户信息收集、使用及保护】\n3.1 您同意并授权飞腾公司为履行本协议之目的收集您的用户信息，这些信息包括您在实名注册系统中注册的信息、您游戏账号下的游戏数据以及其他您在使用飞腾公司服务的过程中向飞腾公司提供或飞腾公司基于安全、用户体验优化等考虑而需收集的信息，土豪金麻将对您的用户信息的收集将遵循相关法律的规定。\n3.2 您充分理解并同意：为更好地向您提供飞腾公司服务，上海敲麻麻将可以将您的用户信息提交给其关联公司，且飞腾公司有权自行或通过第三方对您的用户信息进行整理、统计、分析及利用。\n3.3 您充分理解并同意：飞腾公司或其合作的第三方可以根据您的用户信息，通过短信、电话、邮件等各种方式向您提供关于上海敲麻麻将的活动信息、推广信息等各类信息。\n 四、【免责声明】\n4.1 飞腾公司服务以“现状”提供给您。飞腾公司不保证：飞腾公司服务无错误及不会中断、所有缺陷已被更正、或飞腾公司服务不会受到病毒或任何其它因素的损害。除非有法律明确规定，飞腾公司在此明确声明不承担任何明示或默示的担保责任，包括但不限于对飞腾公司服务的性能、适用性或不侵权的担保。\n4.2 在任何情况下，飞腾公司不对因不可抗力导致的您在使用飞腾公司服务过程中遭受的损失承担责任。该等不可抗力事件包括但不限于国家法律、法规、政策及国家机关的命令或者其它的诸如地震、水灾、雪灾、火灾、海啸、台风、罢工、战争等不可预测、不可避免且不可克服的事件。\n4.3飞腾公司可独立决定随时变更、终止、中止您对任何飞腾公司服务的使用，无须向您发出任何提前通知，但根据法律法规规定或您与飞腾公司的约定需要提前通知的除外。若因您的行为违反法律法规的规定或本协议的规定，土豪金麻将根据相关规定终止、中止您使用任何飞腾公司服务，则飞腾公司无须向您承担任何责任，且有权要求您承担相应的责任。\n4.4 飞腾公司可能因游戏软件BUG、版本更新缺陷、第三方病毒攻击或其他任何因素导致您的游戏角色、游戏道具、游戏装备及游戏币等账号数据发生异常。在数据异常的原因未得到查明前，飞腾公司有权暂时冻结该游戏账号；若查明数据异常为非正常游戏行为，飞腾公司有权恢复游戏账号数据至异常发生前的原始状态（包括向第三方追回被转移数据），且飞腾公司无须向您承担任何责任。\n4.5 飞腾公司未授权您从任何第三方通过购买、接受赠与或者其他的方式获得游戏账号、游戏道具、游戏装备、游戏币等，飞腾公司不对第三方交易的行为负责，并且不受理因任何第三方交易发生纠纷而带来的申诉。\n4.6 您充分理解到：第三方在飞腾公司中投放的广告、链接或者其它形式的推广内容，均是由其自行提供的，您应当自行判断其真实性，飞腾公司对其推广内容不作任何明示或者默示的担保。\n4.7 您充分理解到：不同操作系统之间存在不互通的客观情况，该客观情况并非土豪金麻将造成，由此可能导致您在某一操作系统中的充值和游戏数据不能顺利转移到另一操作系统中。由于您在不同系统进行切换造成的充值损失和游戏数据丢失风险应由您自行承担，不得要求飞腾公司承担任何责任。\n4.8 您充分理解到：飞腾公司中可能会设置强制对战区域或玩法，如果您不同意强制对战，请您不要进入该游戏或游戏区域；您的进入，将被视为同意该玩法并接受相应后果。                  \n五、【知识产权】\n5.1 飞腾公司是飞腾公司的知识产权权利人。飞腾公司的一切著作权、商标权、专利权、商业秘密等知识产权，以及与飞腾公司相关的所有信息内容（包括文字 、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，飞腾公司享有上述知识产权， 但相关权利人依照法律规定应享有的权利除外。\n5.2 您在使用飞腾公司服务中产生的游戏数据的所有权和知识产权归飞腾公司所有，飞腾公司有权处置该游戏数据。\n5.3 飞腾公司可能涉及第三方知识产权，而该等第三方对您基于本协议在上海敲麻麻将中使用该等知识产权有要求的，飞腾公司将以适当方式向您告知该要求，您应当一并遵守。\n六、【遵守当地法律监管】\n6.1 您在使用飞腾公司服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。\n6.2 您应避免因使用飞腾公司服务而使飞腾公司卷入政治和公共事件，否则飞腾公司有权暂停或终止对您的服务。\n七、【隐私政策】保护用户个人信息及隐私是飞腾公司的一项基本原则。除本协议另有规定外，飞腾公司服务将遵循飞腾公司统一公布的相关隐私政策\n八、【管辖与法律适用】\n8.1 本协议签订地为中华人民共和国北京市朝阳区。\n8.2 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。\n8.3 若您和飞腾公司之间因本协议发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交至本协议签订地有管辖权的人民法院管辖。\n8.4 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵\n义解释的依据。\n8.5 本协议条款无论因何种原因部分无效，其余条款仍有效，对各方具有约束力。\n九、【其他】\n9.1 根据国家新闻出版总署关于健康游戏的忠告，飞腾公司提醒您：抵制不良游戏，拒绝盗版游戏；注意自我保护，谨防受骗上当；适度游戏益脑，沉迷游戏伤身。\n9.2 如果您对本协议或飞腾公司服务有意见或建议，可与飞腾公司客户服务部门联系，我们会给予您必要的帮助。\n                                                      飞腾公司游戏 \n   "
}